const xlsx = require('xlsx');

// 测试数据
const json = {
  "中心园": [{
    "教师\\时间": "刘小花",
    "1号": "",
    "2号": "",
    "3号": "",
    "4号": "",
    "5号": "",
    "6号": "",
    "7号": "",
    "8号": "事假:08:00:00",
    "9号": "",
    "10号": "",
    "11号": "",
    "12号": "",
    "13号": "",
    "14号": "",
    "15号": "",
    "16号": "",
    "17号": "",
    "18号": "",
    "19号": "",
    "20号": "",
    "21号": "",
    "22号": "",
    "23号": "",
    "24号": "",
    "25号": "",
    "26号": "",
    "27号": "",
    "28号": "",
    "29号": "",
    "30号": "病假:08:00:00",
    "31号": "迟到:12:52:16\n离开:18:06:09"
  }, {
    "教师\\时间": "张三",
    "1号": "",
    "2号": "",
    "3号": "",
    "4号": "",
    "5号": "",
    "6号": "",
    "7号": "",
    "8号": "",
    "9号": "",
    "10号": "",
    "11号": "",
    "12号": "",
    "13号": "",
    "14号": "",
    "15号": "事假:08:00:00",
    "16号": "",
    "17号": "",
    "18号": "",
    "19号": "",
    "20号": "",
    "21号": "",
    "22号": "",
    "23号": "",
    "24号": "",
    "25号": "",
    "26号": "",
    "27号": "",
    "28号": "",
    "29号": "",
    "30号": "",
    "31号": ""
  }],
  "楼自庒": [{
    "教师\\时间": "唐三",
    "1号": "",
    "2号": "",
    "3号": "",
    "4号": "",
    "5号": "",
    "6号": "",
    "7号": "",
    "8号": "",
    "9号": "",
    "10号": "",
    "11号": "",
    "12号": "",
    "13号": "",
    "14号": "",
    "15号": "",
    "16号": "",
    "17号": "",
    "18号": "",
    "19号": "",
    "20号": "",
    "21号": "",
    "22号": "",
    "23号": "",
    "24号": "",
    "25号": "",
    "26号": "",
    "27号": "",
    "28号": "",
    "29号": "",
    "30号": "",
    "31号": "迟到:12:52:40\n离开:18:06:20"
  }],
  "分园": [{
    "教师\\时间": "李四",
    "1号": "",
    "2号": "",
    "3号": "",
    "4号": "",
    "5号": "",
    "6号": "",
    "7号": "",
    "8号": "",
    "9号": "",
    "10号": "",
    "11号": "",
    "12号": "",
    "13号": "",
    "14号": "",
    "15号": "",
    "16号": "",
    "17号": "",
    "18号": "",
    "19号": "",
    "20号": "",
    "21号": "",
    "22号": "",
    "23号": "",
    "24号": "",
    "25号": "",
    "26号": "",
    "27号": "",
    "28号": "",
    "29号": "",
    "30号": "",
    "31号": "迟到:12:52:42\n离开:18:06:22"
  }],
  "白浮分园": [{
    "教师\\时间": "崔老师",
    "1号": "",
    "2号": "",
    "3号": "",
    "4号": "",
    "5号": "",
    "6号": "",
    "7号": "",
    "8号": "",
    "9号": "",
    "10号": "",
    "11号": "",
    "12号": "",
    "13号": "",
    "14号": "",
    "15号": "",
    "16号": "",
    "17号": "",
    "18号": "",
    "19号": "",
    "20号": "",
    "21号": "",
    "22号": "",
    "23号": "",
    "24号": "",
    "25号": "",
    "26号": "",
    "27号": "",
    "28号": "",
    "29号": "",
    "30号": "",
    "31号": "迟到:12:52:45\n离开:18:06:23"
  }]
};

function getCharCol(num) {
  let _res = '',
    tmp = 0,
    _sum = 0,
    n = 1,
    tar = 26;
  while (num >= _sum) {
    _sum = (Math.pow(tar, n + 1) - tar) / (tar - 1);
    n += 1;
    if (num >= _sum) {
      tmp = _sum;
    }
  }

  num -= tmp;
  while (num > 0) {
    tmp = num % tar;
    _res = String.fromCharCode(tmp + 65) + _res;
    num = (num - tmp) / tar;
  }

  while (n - 1 > _res.length) {
    _res = 'A' + _res;
  }


  return _res;
}

function generateWS(sheets) {
  let tmpdata = {},
    scol = [],
    scolNames = {},
    scolW = [];
  sheets.map((v) => {
    Object.keys(v).map(k => {
      let _res = scol.find(v => {
        return v === k
      });
      if (!_res) {
        scol.push(k);
      }
    });
  });
  scol.forEach((value, index) => {
    let _name = getCharCol(index)
    scolNames[value] = {
      name: _name,
      mw: value.length * 2
    };
    tmpdata[_name + 1] = {
      v: value
    };
  });
  sheets.forEach((_v, _i) => {
    for (var key in _v) {
      tmpdata[scolNames[key].name + (_i + 2)] = {
        v: _v[key]
      };
      if (_v[key].length * 2 > scolNames[key].mw) {
        scolNames[key].mw = _v[key].length * 2;
      }
    }
  })
  for (let _v in scolNames) {
    scolW.push({
      width: scolNames[_v].mw
    })
  }
  tmpdata['!cols'] = scolW;
  tmpdata['!ref'] = `A1:${getCharCol(scol.length)}${sheets.length + 1}`;
  return tmpdata;
}

function generateWB(json) {
  let sheetnames = [],
    sheets = {};
  Object.keys(json).map((v) => {
    sheetnames.push(v);
    sheets[v] = generateWS(json[v]);
  })

  return {
    "SheetNames": sheetnames,
    "Sheets": sheets
  };
}


let _result = generateWB(json);


console.log('-------', JSON.stringify(_result))
xlsx.writeFile(_result, './tmp/out.xlsx');